[
  {
    "path": "posts/2021-06-22-solution-6/",
    "title": "Lösung zur Übung 6",
    "description": "Die Lösung zur Übung 6 finden Sie unter Lösungen.",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-06-21",
    "categories": [
      "uebungen"
    ],
    "contents": "\nDie Lösung finden Sie im Menu: Lösungen > Übung 6: Lösung.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-22T00:02:38+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-08-solution-5/",
    "title": "Lösung zur Übung 5",
    "description": "Die Lösung zur Übung 5 finden Sie unter Lösungen.",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-06-08",
    "categories": [
      "uebungen"
    ],
    "contents": "\nDie Lösung finden Sie im Menu: Lösungen > Übung 5: Lösung.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-08T16:50:16+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-21-uebung-6/",
    "title": "Übung 6",
    "description": "Übung 6 ist online.",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-05-25",
    "categories": [
      "uebungen"
    ],
    "contents": "\nDie Übung finden Sie im Menu: Übungen > Übung 6.\nLaden Sie bitte Ihre Lösung als ZIP File bis Freitag, 4. Juni um 00:00 Uhr, in den Order für Übung 6 auf ILIAS. Das ZIP File sollte sowohl das Rmarkdown File als auch das generierte HTML File enthalten.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-25T12:24:35+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-20-solution-4/",
    "title": "Lösung zur Übung 4",
    "description": "Die Lösung zur zweiten Übung finden Sie unter Lösungen.",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-05-18",
    "categories": [
      "uebungen"
    ],
    "contents": "\nDie Lösung finden Sie im Menu: Lösungen > Übung 4: Lösung.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-20T15:11:20+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-03-mental-rotation-task/",
    "title": "Online Experiment",
    "description": "Mentale Rotation unter verschiedenen Strategien.",
    "author": [
      {
        "name": "Gerda Wyssen",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-05-04",
    "categories": [],
    "contents": "\nFür die nächste Übung werden Sie gebeten an einem Online-Experiment teilzunehmen. Oft ist es einfacher Daten zu analysieren, wenn man den Task mit dem sie erhoben wurden gut kennt. Dies hilft bei der Interpretation der Daten und dem Verstehen, was die Parameter genau beschreiben.\nDas Online-Experiment besteht aus einer mentalen Rotationsaufgabe, welche mit zwei verschiedenen Strategien gelöst werden muss. Mentale Rotationen sind in unserem Alltag wichtig, um z.B. einem Freund den Weg aus seiner Perspektive zu erklären oder ein Werkzeug in die richtige Ausgangsposition zu bringen. Diese Studie dient dazu den Einfluss verschiedener Strategien auf mentale Rotationen zu untersuchen.\n\nDiese Aufgabe ermöglicht keine Rückschlüsse auf die Person oder spezifische Eigenschaften über den Task hinaus. Bitte lesen Sie die Einverständniserklärung durch und klicken Sie anschliessend auf den Link. Sie dürfen Angaben zu Ihrer Person machen müssen jedoch nicht, dann können Sie stattdessen einfach in jedes Feld ein X schreiben. Bitte geben Sie nicht falsche Angaben an. Wir freuen uns sehr über Angaben zur Person, dies ermöglicht es uns, die Daten in unserer Forschung zu verwenden und Sie zu publizieren. Daten mit einem X werden nur für diesen Kurs verwendet und anschliessend gelöscht.\n\nInfos zum Online Experiment\nVielen herzlichen Dank für die Teilnahme am Experiment!\nEinige wichtige Punkte für die Durchführung:\nBitte führen Sie die Studie an einem Computer durch (nicht am Tablet oder Handy), da ein grösserer Bildschirm und eine Tastatur erforderlich sind.\nBitte sorgen Sie dafür, dass Sie für den Zeitraum des Experiments ungestört sind. Führen Sie das Experiment bitte an einem Stück und konzentriert durch.\nDas Experiment läuft am besten auf Firefox, Microsoft Edge oder Safari. Andere Browser haben teilweise Schwierigkeiten das Experiment anzuzeigen.\nLesen Sie bitte die Information & Einverständnis durch, danach können Sie auf den Link klicken.\nInformation zur Teilnahme an der Studie und Einverständnis\nVielen Dank für das Interesse und die Teilnahmebereitschaft an dieser Studie. Bevor Sie sich bereit erklären, an der Studie teilzunehmen, ist es wichtig, dass Sie die folgenden Erklärungen genau durchlesen. Ihnen wird der Zweck dieser Studie erklärt, ebenso die Prozedur mit dazugehörigen Risiken, Unannehmlichkeiten und Vorsichtsmassnahmen.\nDas Experiment dauert ungefähr 30 Minuten und beinhaltet Fragen zur Person und eine Rotationsaufgabe, welche mit unterschiedlichen Strategien gelöst werden soll. Für diese Studie gibt es keine Ausschlusskriterien. Die Teilnahme an der Studie stellt kein uns bekanntes Risiko dar.\nDie Teilnahme an der Studie ist freiwillig und kann jederzeit und ohne Begründung abgebrochen werden. Hierbei entstehen für die Teilnehmenden keine Nachteile. Diese Studie wurde durch die Ethik-Kommission der philosophisch-humanwissenschaftlichen Fakultät der Universität Bern genehmigt. Bei Fragen oder Bedenken dürfen Sie sich jederzeit an die Studienleiterin wenden: gerda.wyssen@psy.unibe.ch.\nMit der Teilnahme bestätigen Sie, dass Sie schriftlich über die Ziele, den Ablauf der Studie, über die zu erwartenden Wirkungen, über mögliche Vor-und Nachteile sowie über eventuelle Risiken informiert wurden und dass Sie die oben genannten Studie abgegebene schriftliche Information gelesen und verstanden haben. Zudem, dass Ihre Fragen im Zusammenhang mit der Teilnahme zufriedenstellend beantwortet worden sind, und Sie genügend Zeit hatten, die Entscheidung zu treffen, an der Studie teilzunehmen.Sie wurden in Kenntnis gesetzt, dass Ihre Daten nur in pseudonymisierter Form gespeichert werden. Die Resultate können im Kurs ausgewertet und aus wissenschaftlichen Gründen veröffentlicht werden, wobei die Anonymität aller Teilnehmer gewahrt bleibt. Jede Versuchsperson kann bis zum Ende der Datenerhebung die Löschung ihrer personenbezogenen Daten verlangen. Nach Ende der Datenerhebung wird die Zuordnungsliste vernichtet und die erhobenen Daten können nicht mehr den einzelnen Versuchspersonen zugeordnet, und daher auch nicht mehr gelöscht werden. Mitglieder der zuständigen Ethikkommission zu Prüf-und Kontrollzwecken können Einsicht nehmen unter strikter Einhaltung der Vertraulichkeit. Sie nehmen an dieser Studie freiwillig teil. Sie können jederzeit und ohne Angabe von Gründen Ihre Zustimmung zur Teilnahme widerrufen, ohne dass Ihnen deswegen Nachteile entstehen.\nLink zum Experiment\nKlicken Sie bitte auf den untenstehenden Link und befolgen Sie bitte die Anweisungen, die Sie dort vorfinden. Bei participant können Sie eine 5-stellige Zahl eingeben.\nLegen Sie den linken Zeigefinger auf die linke Pfeiltaste und den rechten Zeigefinger auf die rechte Pfeiltaste um die Aufgabe zu lösen\nLösen Sie die Aufgaben jeweils so schnell wie möglich\nOnline Experiment Mentale Rotation\n\nFalls Sie beim Öffnen oder Durchführen des Experiments Probleme haben, melden Sie sich bitte auf Zulip.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-04T13:04:19+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-04-uebung-5/",
    "title": "Übung 5",
    "description": "Übung 5 ist online.",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-05-04",
    "categories": [
      "uebungen"
    ],
    "contents": "\nDie Übung finden Sie im Menu: Übungen > Übung 5.\nSie haben für diese Übung 8 Tage Zeit. Laden Sie bitte diesmal Ihre Lösung als ZIP File bis Donnerstag, 13. Mai um 00:00 Uhr, in den Order für Übung 5 auf ILIAS. Das ZIP File sollte sowohl das Rmarkdown File als auch das generierte HTML File enthalten.\nNennen Sie Ihr File Matrikelnummer_Nachname_uebung-5.zip.\n\nBei dieser Übung werden keine Lösungen akzeptiert, bei denen nichts geschrieben wurde. Dies bedeutet: wenn in der Aufgabe steht “Bitte schreiben Sie kurz…” dann erwarte ich auch, dass etwas geschrieben wird.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-04T05:35:54+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-20-uebung-4/",
    "title": "Übung 4",
    "description": "Die vierte Übung ist online.",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-04-20",
    "categories": [
      "uebungen"
    ],
    "contents": "\nDie Übung finden Sie im Menu: Übungen > Übung 4.\nSie haben für diese Übung 8 Tage Zeit. Laden Sie Ihre Lösung als Rmarkdown File bis Mittwoch, 28. April um 00:00 Uhr, in den Order für Übung 4 auf ILIAS. Falls Rmarkdown nicht funkionieren sollte, werden auch Lösungen in Form eines R Skriptes akzeptiert. Nennen Sie Ihr File Matrikelnummer_Nachname_uebung-4.Rmd oder Matrikelnummer_Nachname_uebung-4.R, z. B. 15-172-874_Nachname_uebung-4.Rmd.\n\nBevor Sie einreichen, vergewissern Sie sich bitte, dass Ihr Rmarkdown File geknittet werden kann, und dass der R Code ohne Fehler läuft.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-04-26T17:24:13+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-09-solution-2/",
    "title": "Lösung zur Übung 2",
    "description": "Die Lösung zur zweiten Übung finden Sie unter Lösungen",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-04-09",
    "categories": [
      "uebungen"
    ],
    "contents": "\nDie Lösung finden Sie im Menu: Lösungen > Übung 2: Lösung.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-20T15:11:46+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-25-uebung-2/",
    "title": "Übung 2",
    "description": "Die zweite Übung ist online.",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-03-25",
    "categories": [
      "uebungen"
    ],
    "contents": "\nDie Übung finden Sie im Menu: Übungen > Übung 2.\nSie haben für diese Übung Zeit bis 4. April, 00:00 Uhr. Laden Sie Ihre Lösung als Rmarkdown File in den Order für Übung 2 auf ILIAS. Falls Rmarkdown nicht funkionieren sollte, werden auch Lösungen in Form eines R Skriptes akzeptiert. Nennen Sie Ihr File Matrikelnummer_Nachname_uebung-2.Rmd oder Matrikelnummer_Nachname_uebung-2.R, z. B. 15-172-874_Nachname_uebung-2.Rmd.\n\nBevor Sie einreichen, vergewissern Sie sich bitte, dass Ihr Rmarkdown File geknittet werden kann, und dass der R Code ohne Fehler läuft.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-03-25T21:35:55+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-22-solution-1/",
    "title": "Lösung zur Übung 1",
    "description": "Die Lösung zur ersten Übung finden Sie unter Lösungen",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-03-22",
    "categories": [
      "uebungen"
    ],
    "contents": "\nDie Lösung finden Sie im Menu: Lösungen > Übung 1: Lösung.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-20T15:12:06+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-04-uebung-1/",
    "title": "Übung 1",
    "description": "Die erste Übung ist online.",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-03-04",
    "categories": [
      "uebungen"
    ],
    "contents": "\nDie Übung finden Sie im Menu: Übungen > Übung 1.\nSie haben für diese Übung eine Woche Zeit. Laden Sie Ihre Lösung als Rmarkdown File bis Donnerstag, 11. März um 00:00 Uhr, in den Order für Übung 1 auf ILIAS. Falls Rmarkdown nicht funkionieren sollte, werden auch Lösungen in Form eines R Skriptes akzeptiert. Nennen Sie Ihr File Matrikelnummer_Nachname_uebung-1.Rmd oder Matrikelnummer_Nachname_uebung-1.R, z. B. 15-172-874_Nachname_uebung-1.Rmd.\n\nBevor Sie einreichen, vergewissern Sie sich bitte, dass Ihr Rmarkdown File geknittet werden kann, und dass der R Code ohne Fehler läuft.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-03-25T21:35:55+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-02-install-rstan/",
    "title": "Rstan und brms installieren",
    "description": "Eine Anleitung zur Installation der `rstan` und `brms` R packages.",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-03-02",
    "categories": [
      "rstan",
      "brms"
    ],
    "contents": "\nFür das Beispiel am Ende der 2. Sitzung brauchen sie rstan und brms. Bevor Sie diese installieren, sollten sie einen C++ Compiler installieren. Die Anleitungen für Windows, MacOS und Linux finden Sie hier: https://github.com/stan-dev/rstan/wiki/RStan-Getting-Started#configuring-c-toolchain.\nWenn Sie Hilfen benötigen, bitte im #troubleshooting Stream in Zulip fragen.\nWenn Sie die C++ Toolchain installiert haben, können Sie rstan und brms installieren:\n\n\ninstall.packages(\"rstan\", repos = \"https://cloud.r-project.org/\", dependencies = TRUE)\ninstall.packages(\"brms\")\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-03-13T23:26:43+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-01-zoom/",
    "title": "Zoom Links",
    "description": "Zoom URLs für die Vor- und Nachmittagssitzungen.",
    "author": [
      {
        "name": "Andrew Ellis",
        "url": "https://github.com/awellis"
      }
    ],
    "date": "2021-03-01",
    "categories": [],
    "contents": "\nVormittag\nZeit: 10:15 - 12:00\nURL: https://unibe-ch.zoom.us/j/93649599809?pwd=ekI1R0JiWS9WVmMySW4rSTZESzhTdz09\nMeeting ID: 936 4959 9809\nPasscode: 16068\nNachmittag\nZeit: 14:15 - 16:00\nURL: https://unibe-ch.zoom.us/j/92669720311?pwd=OUdiTVVOMk51eFZ4U0tzWXpNMkMyUT09\nMeeting ID: 926 6972 0311\nPasscode: 35651\n\n\n\n",
    "preview": {},
    "last_modified": "2021-03-13T23:26:43+01:00",
    "input_file": {}
  }
]
